{
  "content": "> <@&1229404809300545609>",
  "embeds": [
    {
      "description": "👋 Greetings! We're excited to announce that we've reopened the applications for our Playtesting Team (Previously known as Quality Assurance)! If you're enthusiastic about restoring the cherished Legacy Edition to the Java Edition community, possess a knack for bug-hunting, and are eager to contribute to our project, this opportunity is tailor-made for you!\n\n## 🤔 What is Playtesting?\nPlaytesting involves meticulously scrutinizing our mod to detect any bugs, glitches, or issues that require rectification before the official release. As a Playtester, you'll play a pivotal role in ensuring the quality and stability of our mod.\n\n## ❔ Why join our Playtesting Team?\n- Collaborate closely with developers and fellow testers to enhance Legacy4J.\n- Acquire invaluable experience in mod development and testing.\n- Make a substantial impact on the Minecraft community by resurrecting the beloved Legacy Edition experience.\n\n## 📋 How to Apply:\nTo apply, simply complete the Playtesting Team Application [here](https://docs.google.com/forms/d/e/1FAIpQLSf2YoFfbm2vSPJooxCPm6GkIqp68Jd5_Zy2uWqAW5hjUFgVlA/viewform?usp=sf_link). Please ensure that all provided information is accurate and comprehensive.\n\n## 🔎 Requirements\n- Strong familiarity with both Minecraft and LCE and their mechanics.\n- Excellent communication skills to effectively report bugs and issues.\n- Availability to dedicate regular time to testing the mod.\n- Previous experience in Playtesting or modding is advantageous but not mandatory.\n\n## 📕 Rules\n- Applicants must agree to abide by our team guidelines, which can be found [here](https://kyubion-studios.github.io/#-2).",
      "color": 2497834,
      "footer": {
        "text": "All applications will undergo through review, and only successful candidates will be contacted through Discord.",
        "icon_url": "https://raw.githubusercontent.com/Kyubion-Studios/Kyubion-Branding/main/logos/default.png"
      }
    }
  ],
  "attachments": []
}